{"sources": [
    {
        "ident": "myc",
        "rank": 2,
        "title": "MYC-induced human acute myeloid leukemia requires a continuing IL-3/GM-CSF costimulus",
        "body": "Hematopoietic clones with leukemogenic mutations arise in healthy people as they age, but progression to acute myeloid leukemia (AML) is rare. Recent evidence suggests that the microenvironment may play an important role in modulating human AML population dynamics."
    },
    {
        "ident": "aml",
        "rank": 1,
        "title": "Novel Gene Signature Reveals Prognostic Model in Acute Myeloid Leukemia",
        "body": "Acute myeloid leukemia (AML) is a clonal malignant disease with poor prognosis and a low overall survival rate. Although many studies on the treatment and detection of AML have been conducted, the molecular mechanism of AML development and progression has not been fully elucidated. The present study was designed to pursuit the molecular mechanism of AML using a comprehensive bioinformatics analysis, and build an applicable model to predict the survival probability of AML patients in clinical use."
    },
    {
        "ident": "flowering",
        "rank": 0,
        "title": "Growth and photosynthesis of Japanese flowering cherry under simulated microgravity conditions",
        "body": "The photosynthetic rate, the leaf characteristics related to photosynthesis, such as the chlorophyll content, chlorophyll a/b ratio and density of the stomata, the leaf area and the dry weight in seedlings of Japanese flowering cherry grown under normal gravity and simulated microgravity conditions were examined. No significant differences were found in the photosynthetic rates between the two conditions."
    },
    {
        "ident": "ras",
        "rank": 0,
        "title": "RAS and MYC: Co-conspirators in Cancer",
        "body": "Aberrant activation of RAS influences a variety of cellular pathways, the majority of which have been highlighted in RAS pathway v2.0. Despite this knowledge, efforts to attenuate RAS activity through the therapeutic inhibition of downstream signaling molecules have been relatively unsuccessful, in large part due to the ability of RAS signaling pathways to “rewire”, increasing therapeutic resistance1,2. Given our current inability to directly inhibit RAS, identification of an essential downstream target in RAS-driven cancers would be highly valuable. Here, we discuss RAS-mediated posttranslational modifications (PTMs) of c-MYC (MYC) that increase MYC activity and position MYC as a critical effector of RAS-driven cancer."
    },
    {
        "ident": "ABC",
        "rank": 0,
        "title": "ABC",
        "body": "ABCDEFGHIJK"
    },
    {
        "ident": "Cherry Blossom",
        "rank": 1,
        "title": "Cherry Blossoms in Japan",
        "body": "Hanami, Japan, Spring, flower viewing, cherry blossom"
    }
]}